# 1.library input

In [ ]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import altair as alt
import seaborn as sns
sns.set()
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split

# 2.data input

In [ ]:
e_sv=pd.read_csv("employee_survey_data.csv")

In [ ]:
gd=pd.read_csv("general_data.csv")

In [ ]:
m_sv=pd.read_csv("manager_survey_data.csv")

# 3.data proprocessing

## 3.1 merge the dataset

In [ ]:
#merge the three dataset by employee_id, and name it "hr"
gd_e=gd.merge(e_sv,on='EmployeeID')
hr=gd_e.merge(m_sv,on='EmployeeID')

## 3.2 revise the variable name

In [ ]:
#chage the variable name to non-capital, easy one
hr.rename({'Age':'age'},axis=1,inplace=True)
hr.rename({'Attrition':'attrition'},axis=1,inplace=True)
hr.rename({'BusinessTravel':'business_travel'},axis=1,inplace=True)
hr.rename({'Department':'department'},axis=1,inplace=True)
hr.rename({'DistanceFromHome':'dfh'},axis=1,inplace=True)
hr.rename({'Education':'edu'},axis=1,inplace=True)
hr.rename({'EducationField':'edu_field'},axis=1,inplace=True)
hr.rename({'EmployeeCount':'employee_count'},axis=1,inplace=True)
hr.rename({'EmployeeID':'employee_id'},axis=1,inplace=True)
hr.rename({'Gender':'gender'},axis=1,inplace=True)
hr.rename({'JobLevel':'job_level'},axis=1,inplace=True)
hr.rename({'JobRole':'job_role'},axis=1,inplace=True)
hr.rename({'MaritalStatus':'marital'},axis=1,inplace=True)
hr.rename({'MonthlyIncome':'income'},axis=1,inplace=True)
hr.rename({'NumCompaniesWorked':'num_companiesworked'},axis=1,inplace=True)
hr.rename({'Over18':'over18'},axis=1,inplace=True)
hr.rename({'PercentSalaryHike':'salary_increase'},axis=1,inplace=True)
hr.rename({'PerformanceRating':'performance'},axis=1,inplace=True)
hr.rename({'EnvironmentSatisfaction':'satisfaction_environment'},axis=1,inplace=True)
hr.rename({'StandardHours':'standard_hours'},axis=1,inplace=True)
hr.rename({'StockOptionLevel':'stock_option'},axis=1,inplace=True)
hr.rename({'TotalWorkingYears':'years_working'},axis=1,inplace=True)
hr.rename({'TrainingTimesLastYear':'training'},axis=1,inplace=True)
hr.rename({'WorkLifeBalance':'wlb'},axis=1,inplace=True)
hr.rename({'YearsAtCompany':'years_company'},axis=1,inplace=True)
hr.rename({'YearsSinceLastPromotion':'years_promotion'},axis=1,inplace=True)
hr.rename({'YearsWithCurrManager':'years_manager'},axis=1,inplace=True)
hr.rename({'JobInvolvement':'job_involvement'},axis=1,inplace=True)
hr.rename({'JobSatisfaction':'satisfaction_job'},axis=1,inplace=True)

##3.3 encode attrition as dummy variable

In [ ]:
hr["attrition_d"]=pd.get_dummies(hr["attrition"],drop_first=True)

## 3.4 deal with the missing value

In [ ]:
#detect the missing value
print(hr.isna().sum().sort_values())

age                          0
job_involvement              0
years_manager                0
years_promotion              0
years_company                0
training                     0
stock_option                 0
standard_hours               0
salary_increase              0
over18                       0
performance                  0
income                       0
attrition_d                  0
job_role                     0
attrition                    0
business_travel              0
department                   0
marital                      0
edu                          0
dfh                          0
edu_field                    0
employee_count               0
employee_id                  0
gender                       0
job_level                    0
years_working                9
num_companiesworked         19
satisfaction_job            20
satisfaction_environment    25
wlb                         38
dtype: int64

In [ ]:
#check the type of the missing value variable
hr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4410 entries, 0 to 4409
Data columns (total 30 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       4410 non-null   int64
 1   attrition                 4410 non-null   object
 2   business_travel           4410 non-null   object
 3   department                4410 non-null   object
 4   dfh                       4410 non-null   int64
 5   edu                       4410 non-null   int64
 6   edu_field                 4410 non-null   object
 7   employee_count            4410 non-null   int64
 8   employee_id               4410 non-null   int64
 9   gender                    4410 non-null   object
 10  job_level                 4410 non-null   int64
 11  job_role                  4410 non-null   object
 12  marital                   4410 non-null   object
 13  income                    4410 non-null   int64
 14  num_companiesworked       4391 non-null   float64
 15  over18                    4410 non-null   object
 16  salary_increase           4410 non-null   int64
 17  standard_hours            4410 non-null   int64
 18  stock_option              4410 non-null   int64
 19  years_working             4401 non-null   float64
 20  training                  4410 non-null   int64
 21  years_company             4410 non-null   int64
 22  years_promotion           4410 non-null   int64
 23  years_manager             4410 non-null   int64
 24  satisfaction_environment  4385 non-null   float64
 25  satisfaction_job          4390 non-null   float64
 26  wlb                       4372 non-null   float64
 27  job_involvement           4410 non-null   int64
 28  performance               4410 non-null   int64
 29  attrition_d               4410 non-null   uint8
dtypes: float64(5), int64(16), object(8), uint8(1)
memory usage: 1.0+ MB

In [ ]:
hr=hr.dropna()
#for all five variables with missing values are float, we can also use sklearn to impute value by mean, but due to we will use individual data later, so here use 'dropna' instead of 'imputing'
#X_num=hr.loc[:,["years_working","num_companiesworked","satisfaction_job","satisfaction_environment","wlb"]].values
#y=hr["attrition"].values
#X_train_num,X_test_num,y_train,y_test=train_test_split(X_num,y,test_size=0.2,random_state=24)
#imp_num=SimpleImputer()
#X_train_num=imp_num.fit_transform(X_train_num)
#X_test_num=imp_num.transform(X_test_num)

In [ ]:
print(hr.isna().sum().sort_values())

age                         0
job_involvement             0
wlb                         0
satisfaction_job            0
satisfaction_environment    0
years_manager               0
years_promotion             0
years_company               0
training                    0
years_working               0
stock_option                0
standard_hours              0
salary_increase             0
over18                      0
num_companiesworked         0
income                      0
marital                     0
job_role                    0
job_level                   0
gender                      0
employee_id                 0
employee_count              0
edu_field                   0
edu                         0
dfh                         0
department                  0
business_travel             0
attrition                   0
performance                 0
attrition_d                 0
dtype: int64

##3.5 drop constant

In [ ]:
hr.nunique()

age                           43
attrition                      2
business_travel                3
department                     3
dfh                           29
edu                            5
edu_field                      6
employee_count                 1
employee_id                 4300
gender                         2
job_level                      5
job_role                       9
marital                        3
income                      1349
num_companiesworked           10
over18                         1
salary_increase               15
standard_hours                 1
stock_option                   4
years_working                 40
training                       7
years_company                 37
years_promotion               16
years_manager                 18
satisfaction_environment       4
satisfaction_job               4
wlb                            4
job_involvement                4
performance                    2
attrition_d                    2
dtype: int64

In [ ]:
#"employee_count","over18",and "standard_hours" are not variables, so drop the contants
hr=hr.drop(["employee_count","over18","standard_hours"],axis=1)

# 4.prepare the dataframe

In [ ]:
order=['employee_id','age','dfh','edu','job_level','income','stock_option','salary_increase','training','years_company','years_promotion','years_manager','num_companiesworked','years_working','performance','job_involvement','satisfaction_environment','satisfaction_job','wlb',"attrition_d",'business_travel','department','edu_field','gender','job_role','marital']

In [ ]:
hr=hr[order]

In [ ]:
hr

,employee_id,age,dfh,edu,job_level,income,stock_option,salary_increase,training,years_company,...,satisfaction_environment,satisfaction_job,wlb,attrition_d,business_travel,department,edu_field,gender,job_role,marital
0,1,51,6,2,1,131160,0,11,6,1,...,3.0,4.0,2.0,0,Travel_Rarely,Sales,Life Sciences,Female,Healthcare Representative,Married
1,2,31,10,1,1,41890,1,23,3,5,...,3.0,2.0,4.0,1,Travel_Frequently,Research & Development,Life Sciences,Female,Research Scientist,Single
2,3,32,17,4,4,193280,3,15,2,5,...,2.0,2.0,1.0,0,Travel_Frequently,Research & Development,Other,Male,Sales Executive,Married
3,4,38,2,5,3,83210,3,11,5,8,...,4.0,4.0,3.0,0,Non-Travel,Research & Development,Life Sciences,Male,Human Resources,Married
4,5,32,10,1,1,23420,2,12,2,6,...,4.0,1.0,3.0,0,Travel_Rarely,Research & Development,Medical,Male,Sales Executive,Single
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4404,4405,29,4,3,2,35390,0,18,2,6,...,3.0,4.0,3.0,0,Travel_Rarely,Sales,Other,Female,Human Resources,Single
4405,4406,42,5,4,1,60290,1,17,5,3,...,4.0,1.0,3.0,0,Travel_Rarely,Research & Development,Medical,Female,Research Scientist,Single
4406,4407,29,2,4,1,26790,0,15,2,3,...,4.0,4.0,3.0,0,Travel_Rarely,Research & Development,Medical,Male,Laboratory Technician,Divorced
4407,4408,25,25,2,2,37020,0,20,4,4,...,1.0,3.0,3.0,0,Travel_Rarely,Research & Development,Life Sciences,Male,Sales Executive,Married
4408,4409,42,18,2,1,23980,1,14,2,9,...,4.0,1.0,3.0,0,Travel_Rarely,Sales,Medical,Male,Laboratory Technician,Divorced

In [ ]:
outputpath='/content/hru.csv'
hr.to_csv(outputpath,sep=',',index=False,header=True)